### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.web_apps_itn.azurerm_role_assignment.config_queue_op_func["Storage Queue Data Contributor"] will be destroyed
  # (because azurerm_role_assignment.config_queue_op_func is not in configuration)
  - resource "azurerm_role_assignment" "config_queue_op_func" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/fc1bc241-b117-41bc-80a3-eacdbd9d4771" -> null
      - name                                   = "fc1bc241-b117-41bc-80a3-eacdbd9d4771" -> null
      - principal_id                           = "c842ff1a-49c0-407d-9a76-210489abb536" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name                   = "Storage Queue Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.config_queue_op_func["Storage Queue Data Message Processor"] will be destroyed
  # (because azurerm_role_assignment.config_queue_op_func is not in configuration)
  - resource "azurerm_role_assignment" "config_queue_op_func" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/e2199fb2-e1d0-83d4-0dfb-421d65c39512" -> null
      - name                                   = "e2199fb2-e1d0-83d4-0dfb-421d65c39512" -> null
      - principal_id                           = "c842ff1a-49c0-407d-9a76-210489abb536" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name                   = "Storage Queue Data Message Processor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # (because azurerm_role_assignment.config_queue_op_func is not in configuration)
  - resource "azurerm_role_assignment" "config_queue_op_func" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/e3cfb116-ce79-aa69-3f0a-b0b5a5613f03" -> null
      - name                                   = "e3cfb116-ce79-aa69-3f0a-b0b5a5613f03" -> null
      - principal_id                           = "c842ff1a-49c0-407d-9a76-210489abb536" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/19e7f393-937e-4f77-808e-94535e297925" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.config_queue_op_func_itn["Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "config_queue_op_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c842ff1a-49c0-407d-9a76-210489abb536"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.config_queue_op_func_itn["Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "config_queue_op_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c842ff1a-49c0-407d-9a76-210489abb536"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "config_queue_op_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c842ff1a-49c0-407d-9a76-210489abb536"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app["Storage Queue Data Message Processor"] will be destroyed
  # (because azurerm_role_assignment.storage_op_app is not in configuration)
  - resource "azurerm_role_assignment" "storage_op_app" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/a3fb3aa1-6ca5-eac4-b008-bbfbb38fc047" -> null
      - name                                   = "a3fb3aa1-6ca5-eac4-b008-bbfbb38fc047" -> null
      - principal_id                           = "ed8105a3-4bfe-4103-ac64-e36e86762d23" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name                   = "Storage Queue Data Message Processor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app["Storage Queue Data Message Sender"] will be destroyed
  # (because azurerm_role_assignment.storage_op_app is not in configuration)
  - resource "azurerm_role_assignment" "storage_op_app" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/fa7d46a6-220c-ff60-24b1-2ef03933635b" -> null
      - name                                   = "fa7d46a6-220c-ff60-24b1-2ef03933635b" -> null
      - principal_id                           = "ed8105a3-4bfe-4103-ac64-e36e86762d23" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> null
      - role_definition_name                   = "Storage Queue Data Message Sender" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_itn["Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "storage_op_app_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ed8105a3-4bfe-4103-ac64-e36e86762d23"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_itn["Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "storage_op_app_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ed8105a3-4bfe-4103-ac64-e36e86762d23"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_slot["Storage Queue Data Message Processor"] will be destroyed
  # (because azurerm_role_assignment.storage_op_app_slot is not in configuration)
  - resource "azurerm_role_assignment" "storage_op_app_slot" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/739b2ab0-c330-313a-f75c-eed3b4054a5a" -> null
      - name                                   = "739b2ab0-c330-313a-f75c-eed3b4054a5a" -> null
      - principal_id                           = "86905598-cf6c-4494-8ed7-aca76879bda9" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name                   = "Storage Queue Data Message Processor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_slot["Storage Queue Data Message Sender"] will be destroyed
  # (because azurerm_role_assignment.storage_op_app_slot is not in configuration)
  - resource "azurerm_role_assignment" "storage_op_app_slot" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/2ecc2c94-27b2-13d6-a741-c21bcf65d04d" -> null
      - name                                   = "2ecc2c94-27b2-13d6-a741-c21bcf65d04d" -> null
      - principal_id                           = "86905598-cf6c-4494-8ed7-aca76879bda9" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> null
      - role_definition_name                   = "Storage Queue Data Message Sender" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_slot_itn["Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "storage_op_app_slot_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "86905598-cf6c-4494-8ed7-aca76879bda9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_slot_itn["Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "storage_op_app_slot_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "86905598-cf6c-4494-8ed7-aca76879bda9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_user_func["Storage Queue Data Message Processor"] will be destroyed
  # (because azurerm_role_assignment.storage_user_func is not in configuration)
  - resource "azurerm_role_assignment" "storage_user_func" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/a1ac2e80-d3fe-c687-af05-1f9231758824" -> null
      - name                                   = "a1ac2e80-d3fe-c687-af05-1f9231758824" -> null
      - principal_id                           = "a9dd4109-bac9-46d2-a596-8244801ba1b6" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name                   = "Storage Queue Data Message Processor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_user_func["Storage Queue Data Message Sender"] will be destroyed
  # (because azurerm_role_assignment.storage_user_func is not in configuration)
  - resource "azurerm_role_assignment" "storage_user_func" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/a43c7b72-4f06-4fc2-5994-a8885b93b4ed" -> null
      - name                                   = "a43c7b72-4f06-4fc2-5994-a8885b93b4ed" -> null
      - principal_id                           = "a9dd4109-bac9-46d2-a596-8244801ba1b6" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> null
      - role_definition_name                   = "Storage Queue Data Message Sender" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # (because azurerm_role_assignment.storage_user_func is not in configuration)
  - resource "azurerm_role_assignment" "storage_user_func" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst/providers/Microsoft.Authorization/roleAssignments/6ecd4b2a-fc94-c47c-66bb-678659d3023f" -> null
      - name                                   = "6ecd4b2a-fc94-c47c-66bb-678659d3023f" -> null
      - principal_id                           = "a9dd4109-bac9-46d2-a596-8244801ba1b6" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/19e7f393-937e-4f77-808e-94535e297925" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.Storage/storageAccounts/iopfimsst" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_user_func_itn["Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "storage_user_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9dd4109-bac9-46d2-a596-8244801ba1b6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_user_func_itn["Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "storage_user_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9dd4109-bac9-46d2-a596-8244801ba1b6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "storage_user_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9dd4109-bac9-46d2-a596-8244801ba1b6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.module.op_app.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-app-01"
        name                                           = "io-p-itn-fims-op-app-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_app.azurerm_linux_web_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-app-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-func-01"
        name                                           = "io-p-itn-fims-op-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps_itn.module.user_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-user-func-01"
        name                                           = "io-p-itn-fims-user-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.user_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-user-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 10 to add, 6 to change, 10 to destroy.
```

</details>
